Mr-PauI/ESP32-BinForge/source/ESP32-BinForge/ESP32-BinForge/ESP32-BinForge.cpp
// ESP32-BinForge (c)2025 MrPaul
/*
 *    MIT License
 *
 *    Copyright(c) 2025 Mr - PauI(https://github.com/Mr-PauI/)
 *
 *    Permission is hereby granted, free of charge, to any person obtaining a copy
 *    of this software and associated documentation files(the "Software"), to deal
 *    in the Software without restriction, including without limitation the rights
 *    to use, copy, modify, merge, publish, distribute, sublicense, and /or sell
 *    copies of the Software, and to permit persons to whom the Software is
 *    furnished to do so, subject to the following conditions :
 *
 *    The above copyright notice and this permission notice shall be included in all
 *    copies or substantial portions of the Software.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.IN NO EVENT SHALL THE
 *    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 *    SOFTWARE.
*/
#include "framework.h"
#include "ESP32-BinForge.h"
#include "esp_app_format.h"
#include <iostream>
#include <fstream>
#include <vector>
#include <cstdint>
#include <sstream>
#include <iomanip>

#define MAX_LOADSTRING 100


// Global Variables:
HINSTANCE hInst;                                // current instance
WCHAR szTitle[MAX_LOADSTRING];                  // The title bar text
WCHAR szWindowClass[MAX_LOADSTRING];            // the main window class name
HWND hEditLog = nullptr;                        // the full-screen textbox

// Forward declarations of functions included in this code module:
ATOM                MyRegisterClass(HINSTANCE hInstance);
BOOL                InitInstance(HINSTANCE, int);
LRESULT CALLBACK    WndProc(HWND, UINT, WPARAM, LPARAM);
INT_PTR CALLBACK    About(HWND, UINT, WPARAM, LPARAM);
void MergeROM(HWND);
uint8_t compute_esp32s3_crc(uint8_t* data, int count);
void validate_esp32_bin(const std::string filename);
void revalidate_crc_nosha256(HWND hWnd);
void analyze_file(HWND hWnd);
void analyze_bin(const std::string filename);
using namespace std;

void AppendLog(HWND hEdit, const std::string& text)
{
    int len = GetWindowTextLengthA(hEdit);
    SendMessageA(hEdit, EM_SETSEL, len, len);
    SendMessageA(hEdit, EM_REPLACESEL, FALSE, (LPARAM)text.c_str());
}

void AppendLog_HEX(HWND hEditLog, uint32_t value)
{
    std::stringstream ss;
    ss << std::hex << std::uppercase << std::setw(8) << std::setfill('0') << value;
        

    AppendLog(hEditLog, ss.str());
}

void ClearLog(HWND hEditLog)
{
    SetWindowText(hEditLog, L"");
}

std::streamsize get_file_size(const std::string& filename) {
    std::ifstream file(filename, std::ios::binary | std::ios::ate);
    return file.tellg();
}


// Function to show the open file dialog and return the selected file name
std::string ShowOpenFileDialogBIN(HWND hwnd) {
    OPENFILENAME openFileDialog;       // Common dialog box structure
    TCHAR szFile[260] = { 0 };         // Buffer for file name

    ZeroMemory(&openFileDialog, sizeof(openFileDialog));
    // Initialize OPENFILENAME structure
    openFileDialog.lStructSize = sizeof(openFileDialog); // Size of the structure
    openFileDialog.hwndOwner = hwnd;                     // Owner window handle
    openFileDialog.lpstrFile = szFile;                   // File name buffer
    openFileDialog.lpstrFile[0] = '\0';                  // Initialize the first character to zero
    openFileDialog.nMaxFile = sizeof(szFile) / sizeof(szFile[0]); // Size of the file name buffer
    openFileDialog.lpstrFilter = _T("BIN Files\0*.bin\0All Files\0*.*\0"); // File type filters
    openFileDialog.nFilterIndex = 1;                     // Index of the default filter
    openFileDialog.lpstrFileTitle = NULL;                // File title buffer (optional)
    openFileDialog.nMaxFileTitle = 0;                    // Size of the file title buffer
    openFileDialog.lpstrInitialDir = NULL;               // Initial directory (optional)
    openFileDialog.lpstrTitle = _T("Select input .BIN file");
    openFileDialog.Flags = OFN_PATHMUSTEXIST | OFN_FILEMUSTEXIST; // Flags for file dialog behavior

    // Display the Open dialog box
    if (GetOpenFileName(&openFileDialog) == TRUE) {
        // Convert TCHAR to std::string
#ifdef UNICODE
        std::wstring ws(openFileDialog.lpstrFile);
        return std::string(ws.begin(), ws.end());
#else
        return std::string(openFileDialog.lpstrFile);
#endif
    }

    // If the user cancels the dialog, return an empty string
    return "";
}

// Function to show the open file dialog and return the selected file name
std::string ShowOpenFileDialog(HWND hwnd) {
    OPENFILENAME openFileDialog;       // Common dialog box structure
    TCHAR szFile[260] = { 0 };         // Buffer for file name

    ZeroMemory(&openFileDialog, sizeof(openFileDialog));
    // Initialize OPENFILENAME structure
    openFileDialog.lStructSize = sizeof(openFileDialog); // Size of the structure
    openFileDialog.hwndOwner = hwnd;                     // Owner window handle
    openFileDialog.lpstrFile = szFile;                   // File name buffer
    openFileDialog.lpstrFile[0] = '\0';                  // Initialize the first character to zero
    openFileDialog.nMaxFile = sizeof(szFile) / sizeof(szFile[0]); // Size of the file name buffer
    openFileDialog.lpstrFilter = _T("All Files\0*.*\0Image Files\0*.bmp;*.png;*.jpg;*.jpeg\0Sound Files\0*.wav;*.mp3\0Data Files\0*.dat;*.bin;*.obb;*.blob\0"); // File type filters
    openFileDialog.nFilterIndex = 1;                     // Index of the default filter
    openFileDialog.lpstrFileTitle = NULL;                // File title buffer (optional)
    openFileDialog.nMaxFileTitle = 0;                    // Size of the file title buffer
    openFileDialog.lpstrInitialDir = NULL;               // Initial directory (optional)
    openFileDialog.lpstrTitle = _T("Select data to inject");
    openFileDialog.Flags = OFN_PATHMUSTEXIST | OFN_FILEMUSTEXIST; // Flags for file dialog behavior

    // Display the Open dialog box
    if (GetOpenFileName(&openFileDialog) == TRUE) {
        // Convert TCHAR to std::string
#ifdef UNICODE
        std::wstring ws(openFileDialog.lpstrFile);
        return std::string(ws.begin(), ws.end());
#else
        return std::string(openFileDialog.lpstrFile);
#endif
    }

    // If the user cancels the dialog, return an empty string
    return "";
}

// Function to show the save file dialog and return the selected file 
std::string ShowSaveFileDialog(HWND hwnd) {
    OPENFILENAME saveFileDialog;       // Common dialog box structure
    TCHAR szFile[260] = _T("output.bin"); // Buffer for file name with a suggested filename

    ZeroMemory(&saveFileDialog, sizeof(saveFileDialog));
    // Initialize OPENFILENAME structure
    saveFileDialog.lStructSize = sizeof(saveFileDialog); // Size of the structure
    saveFileDialog.hwndOwner = hwnd;                     // Owner window handle
    saveFileDialog.lpstrFile = szFile;                   // File name buffer
    saveFileDialog.nMaxFile = sizeof(szFile) / sizeof(szFile[0]); // Size of the file name buffer
    saveFileDialog.lpstrFilter = _T("Binary Files\0*.bin\0All Files\0*.*\0"); // File type filters
    saveFileDialog.nFilterIndex = 1;                     // Index of the default filter
    saveFileDialog.lpstrFileTitle = NULL;                // File title buffer (optional)
    saveFileDialog.nMaxFileTitle = 0;                    // Size of the file title buffer
    saveFileDialog.lpstrInitialDir = NULL;               // Initial directory (optional)
    saveFileDialog.Flags = OFN_PATHMUSTEXIST | OFN_OVERWRITEPROMPT; // Flags for file dialog behavior

