Mr-PauI/ESP32-BinForge/source/ESP32-BinForge/ESP32-BinForge/ESP32-BinForge.cpp
    // Display the Save dialog box
    if (GetSaveFileName(&saveFileDialog) == TRUE) {
        // Convert TCHAR to std::string
#ifdef UNICODE
        std::wstring ws(saveFileDialog.lpstrFile);
        return std::string(ws.begin(), ws.end());
#else
        return std::string(saveFileDialog.lpstrFile);
#endif
    }

    // If the user cancels the dialog, return an empty string
    return "";
}

// Regarding signature size
// BinForge uses a fixed 32 - byte random signature to locate the injection region.
// This provides 256 bits of entropy, making accidental matches in firmware binaries effectively impossible.
// Earlier versions successfully used smaller signatures; 32 bytes was chosen as a conservative, future - proof default.
const uint8_t magic_pattern[32] = {
0x94,0x6C,0xAA,0xA0,0xDF,0x62,0xC4,0x02,
0x5F,0x8B,0x02,0xF4,0xA6,0x5E,0xEF,0x82,
0x37,0xE1,0xD5,0xAE,0x0A,0xA8,0x9C,0xF4,
0x7A,0xBB,0x90,0x49,0x70,0xB1,0x6A,0x3E };
// BMO byte pattern
 

// Message handler for Merge ROM
void MergeROM(HWND hWnd)
{
    string inputBIN=ShowOpenFileDialogBIN(hWnd);
    string inputROM = ShowOpenFileDialog(hWnd);
    string outputBIN = ShowSaveFileDialog(hWnd);    
    int filesize = 0;

    if (inputBIN.empty() || inputROM.empty() || outputBIN.empty())
    {
        MessageBoxW(
            hWnd,
            L"Operation cancelled. Pne or more files were not selected.\n\n"
            L"Please select:\n"
            L"* Input firmware (.bin)\n"
            L"* Data file to inject (.*)\n"
            L"* Output firmware (.bin)",
            L"",
            MB_OK | MB_ICONWARNING
        );
        return;
    }

    AppendLog(hEditLog, "-----------------------------------\r\n");
    AppendLog(hEditLog, "  Injecting data into esp32 binary  \r\n");
    AppendLog(hEditLog, "-----------------------------------\r\n");
    AppendLog(hEditLog, "  Locating magic pattern....");
    ofstream output_bin(outputBIN, ios::out | ios::binary);
    ifstream input_bin(inputBIN, ios::in | ios::binary);
    int pattern_location = 0;
    char tempByte;
    int numBytesMatched = 0; // when this reaches the byte pattern count we have found the segment to begin replacing
    while ((!input_bin.eof()) && (numBytesMatched < 32))    
    {
        input_bin.read(&tempByte, 1);
        if ((uint8_t)tempByte == magic_pattern[numBytesMatched])
        {
            numBytesMatched++;
        }
        else
        {   // if this isn't the start of a pattern
            if (tempByte != magic_pattern[0])
            {
                pattern_location++;
                pattern_location += numBytesMatched;// add any bytes we had matched but not counted
                numBytesMatched = 0; // nothing is matching what we expectd
            }
            else
            {   // its the start of our pattern, so lets count it
                numBytesMatched=1;
            }

        }
    }
    input_bin.close();    
    // Ensure we found the pattern
    if (numBytesMatched < 32)
    {
        AppendLog(hEditLog, "  failed!\r\n\r\n");
        AppendLog(hEditLog, "  Operation could not be completed!\r\n");
        AppendLog(hEditLog, "  Reserved segment could not be found\r\n");
        AppendLog(hEditLog, "  Ensure you are using the correct input file\r\n");
        
        /*MessageBoxW(hWnd,
            L"Operation could not be completed\n\n"
            L"Reserved segment could not be found\n"
            L"Ensure you are using the correct input file\n",
            L"",
            MB_OK | MB_ICONWARNING
        );*/
        return;
    }
    AppendLog(hEditLog, "  complete!\r\n");
    // Perform the merge operation
    AppendLog(hEditLog, "  Merging data with binary....");
    // Copy bytes up to the pattern position to the output bin
    input_bin.open(inputBIN, ios::in | ios::binary);
    for (int i = 0; i < pattern_location; i++)
    {
        input_bin.read(&tempByte, 1); // copy byte from input bin
        output_bin.write(&tempByte, 1); // into output bin
        filesize++;
    }
    ifstream input_rom(inputROM, ios::in | ios::binary);
    while (!input_rom.eof())
    {
        input_bin.read(&tempByte, 1); // move forward one byte in input bin
        input_rom.read(&tempByte, 1); // copy byte from input rom
        output_bin.write(&tempByte, 1);// into the output bin
        filesize++;
    }
    // Copy the remaining bytes in the input bim
    while (!input_bin.eof())
    {
        input_bin.read(&tempByte, 1); /// copy byte from input bin
        if (!input_bin.eof())
        {
            output_bin.write(&tempByte, 1);// into the output bin
            filesize++;
        }
    }
    // Cleanup after
    input_rom.close();
    output_bin.close();
    input_bin.close();
    AppendLog(hEditLog, "  complete!\r\n");
    // Regenerate CRC and disable the Sha256 checksum
    validate_esp32_bin(outputBIN);
    AppendLog(hEditLog, "-----------------------------\r\n");
    AppendLog(hEditLog, "  Merging binary complete! \r\n");
    //MessageBox(hWnd, L"Merge binary Complete!", L"Success!", MB_ICONEXCLAMATION | MB_OK);
    return;
}

uint8_t compute_esp32s3_crc(uint8_t *data,int count)
{
    uint8_t crc_value = 0xEF; // value found in https://docs.espressif.com/projects/esptool/en/latest/esp32s3/advanced-topics/firmware-image-format.html
    //uint8_t crc_value = 0;
    for (int i = 0; i < count; i++)
        crc_value ^= data[i];
    return crc_value;
}


int APIENTRY wWinMain(_In_ HINSTANCE hInstance,
                     _In_opt_ HINSTANCE hPrevInstance,
                     _In_ LPWSTR    lpCmdLine,
                     _In_ int       nCmdShow)
{
    UNREFERENCED_PARAMETER(hPrevInstance);
    UNREFERENCED_PARAMETER(lpCmdLine);

    // TODO: Place code here.

    // Initialize global strings
    LoadStringW(hInstance, IDS_APP_TITLE, szTitle, MAX_LOADSTRING);
    LoadStringW(hInstance, IDC_ESP32BINFORGE, szWindowClass, MAX_LOADSTRING);
    MyRegisterClass(hInstance);

    // Perform application initialization:
    if (!InitInstance (hInstance, nCmdShow))
    {
        return FALSE;
    }

    HACCEL hAccelTable = LoadAccelerators(hInstance, MAKEINTRESOURCE(IDC_ESP32BINFORGE));

