Mr-PauI/ESP32-BinForge/source/ESP32-BinForge/ESP32-BinForge/ESP32-BinForge.cpp
    MSG msg;

    // Main message loop:
    while (GetMessage(&msg, nullptr, 0, 0))
    {
        if (!TranslateAccelerator(msg.hwnd, hAccelTable, &msg))
        {
            TranslateMessage(&msg);
            DispatchMessage(&msg);
        }
    }

    return (int) msg.wParam;
}



//
//  FUNCTION: MyRegisterClass()
//
//  PURPOSE: Registers the window class.
//
ATOM MyRegisterClass(HINSTANCE hInstance)
{
    WNDCLASSEXW wcex;

    wcex.cbSize = sizeof(WNDCLASSEX);

    wcex.style          = CS_HREDRAW | CS_VREDRAW;
    wcex.lpfnWndProc    = WndProc;
    wcex.cbClsExtra     = 0;
    wcex.cbWndExtra     = 0;
    wcex.hInstance      = hInstance;
    wcex.hIcon          = LoadIcon(hInstance, MAKEINTRESOURCE(IDI_ESP32BINFORGE));
    wcex.hCursor        = LoadCursor(nullptr, IDC_ARROW);
    wcex.hbrBackground  = (HBRUSH)(COLOR_WINDOW+1);
    wcex.lpszMenuName   = MAKEINTRESOURCEW(IDI_ESP32BINFORGE);
    wcex.lpszClassName  = szWindowClass;
    wcex.hIconSm        = LoadIcon(wcex.hInstance, MAKEINTRESOURCE(IDI_SMALL));

    return RegisterClassExW(&wcex);
}

//
//   FUNCTION: InitInstance(HINSTANCE, int)
//
//   PURPOSE: Saves instance handle and creates main window
//
//   COMMENTS:
//
//        In this function, we save the instance handle in a global variable and
//        create and display the main program window.
//
BOOL InitInstance(HINSTANCE hInstance, int nCmdShow)
{
   hInst = hInstance; // Store instance handle in our global variable
   HMENU hMenu = LoadMenu(hInstance, MAKEINTRESOURCE(IDR_MAINFRAME));

   HWND hWnd = CreateWindowW(
       szWindowClass,
       szTitle,
       WS_OVERLAPPEDWINDOW,
       CW_USEDEFAULT, 0,
       // CW_USEDEFAULT, 0, // default window size
       600, 800,
       nullptr,
       hMenu,        
       hInstance,
       nullptr
   );

   if (!hWnd)
   {
      return FALSE;
   }

   ShowWindow(hWnd, nCmdShow);
   UpdateWindow(hWnd);

   return TRUE;
}

//
//  FUNCTION: WndProc(HWND, UINT, WPARAM, LPARAM)
//
//  PURPOSE: Processes messages for the main window.
//
//  WM_COMMAND  - process the application menu
//  WM_PAINT    - Paint the main window
//  WM_DESTROY  - post a quit message and return
//
//
LRESULT CALLBACK WndProc(HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam)
{
    switch (message)
    {
    case WM_SIZE:
    {
        if (hEditLog)
        {
            MoveWindow(
                hEditLog,
                0, 0,
                LOWORD(lParam),
                HIWORD(lParam),
                TRUE
            );
        }
    }
    break;
    case WM_CREATE:
    {
        hEditLog = CreateWindowExW(
            WS_EX_CLIENTEDGE,
            L"EDIT",
            L"",
            WS_CHILD | WS_VISIBLE |
            WS_VSCROLL | WS_HSCROLL |
            ES_LEFT | ES_MULTILINE |
            ES_AUTOVSCROLL | ES_AUTOHSCROLL |
            ES_READONLY,
            0, 0, 0, 0,
            hWnd,
            nullptr,
            hInst,
            nullptr
        );

        // Optional: fixed-width font (recommended)
        HFONT hFont = (HFONT)GetStockObject(ANSI_FIXED_FONT);
        SendMessage(hEditLog, WM_SETFONT, (WPARAM)hFont, TRUE);
    }
    break;
    case WM_COMMAND:
        {
            int wmId = LOWORD(wParam);
            // Parse the menu selections:
            switch (wmId)
            {
            case IDM_FILE_EXAMINE:
                analyze_file(hWnd);
                break;
            case IDM_FILE_REVALIDATE:
                revalidate_crc_nosha256(hWnd);
                break;
            case IDM_MERGEROM:
                MergeROM(hWnd);
                break;
            case IDM_ABOUT:
                DialogBox(hInst, MAKEINTRESOURCE(IDD_ABOUTBOX), hWnd, About);
                break;
            case IDM_EXIT:
                DestroyWindow(hWnd);
                break;
            default:
                return DefWindowProc(hWnd, message, wParam, lParam);
            }
        }
        break;
    case WM_PAINT:
        {
            PAINTSTRUCT ps;
            HDC hdc = BeginPaint(hWnd, &ps);
            // TODO: Add any drawing code that uses hdc here...
            EndPaint(hWnd, &ps);
        }
        break;
    case WM_DESTROY:
        PostQuitMessage(0);
        break;
    default:
        return DefWindowProc(hWnd, message, wParam, lParam);
    }
    return 0;
}



// Message handler for about box.
INT_PTR CALLBACK About(HWND hDlg, UINT message, WPARAM wParam, LPARAM lParam)
{
    UNREFERENCED_PARAMETER(lParam);
    switch (message)
    {
    case WM_INITDIALOG:
        return (INT_PTR)TRUE;

    case WM_COMMAND:
        if (LOWORD(wParam) == IDOK || LOWORD(wParam) == IDCANCEL)
        {
            EndDialog(hDlg, LOWORD(wParam));
            return (INT_PTR)TRUE;
        }
        break;
    }
    return (INT_PTR)FALSE;
}

void analyze_file(HWND hWnd)
{
    ClearLog(hEditLog);
    string inputBIN = "";
    inputBIN = ShowOpenFileDialogBIN(hWnd);
    if (inputBIN != "")
    {
        analyze_bin(inputBIN);
    }
}

void revalidate_crc_nosha256(HWND hWnd)
{
    ClearLog(hEditLog);
    string inputBIN = "";
    inputBIN = ShowOpenFileDialogBIN(hWnd);
    if (inputBIN != "")
    {
        validate_esp32_bin(inputBIN);
        // Let the log notify the user
        //MessageBox(hWnd, L"File CRC regenerated, SHA256 hash disabled", L"Done!", MB_ICONEXCLAMATION | MB_OK);
    }
}

void validate_esp32_bin(const std::string filename)
{    
    AppendLog(hEditLog, "-----------------------------\r\n");
    AppendLog(hEditLog, "  Revalidating esp32 binary  \r\n");
    AppendLog(hEditLog, "-----------------------------\r\n");
    // Regenerate CRC and disable the Sha256 checksum
    // Step1: Read the entire outBin into memory
    uint8_t stats_images = 0;
    uint8_t stats_errors = 0;
    uint8_t stats_sha256_disabledCount = 0;
    uint8_t stats_crc_regenCount = 0;
    uint8_t* bin_data;
    uint8_t crc_value;
    // Get the file size, there is a faster way to do this, but for now this works
    uint32_t filesize=(uint32_t)get_file_size(filename);
    ifstream input_bin(filename, ios::in | ios::binary);
    bin_data = (uint8_t*)malloc(filesize);
    input_bin.read((char*)bin_data, filesize);
    input_bin.close();
    // Step2: Compute the CRC value's for each segment for each image in the file
    uint32_t image_header = 0;
    uint32_t file_position = 0; // position us at the beginning of the first segment
    for (;file_position < filesize;)
    {
        if (bin_data[file_position] == 0xe9)
        { // we have located an image 
            AppendLog(hEditLog,"Image found at offset 0x" + std::to_string(file_position) + "\r\n");
            esp_image_header_t* hdr = reinterpret_cast<esp_image_header_t*>(bin_data + file_position);
            // Log SPI mode
            AppendLog(hEditLog, "   Flash Mode: ");   
            switch (hdr->spi_mode)
            {
            case 0:
                AppendLog(hEditLog, "QIO\r\n");
                break;
            case 1:
                AppendLog(hEditLog, "QOUT\r\n");
                break;
            case 2:
                AppendLog(hEditLog, "DIO\r\n");
                break;
            case 3:
                AppendLog(hEditLog, "DOUT\r\n");
                break;
            case 4:
                AppendLog(hEditLog, "FAST READ\r\n");
                break;
            case 5:
                AppendLog(hEditLog, "SLOW READ\r\n");
                break;
            default:
                AppendLog(hEditLog, "Unknown\r\n");
                break;
            }
            AppendLog(hEditLog, "      Chip ID: ");
            switch (hdr->chip_id)
            {
            case ESP_CHIP_ID_ESP32:
                AppendLog(hEditLog, "ESP32\r\n");
                break;
            case ESP_CHIP_ID_ESP32S2:
                AppendLog(hEditLog, "ESP32-S2\r\n");
                break;
            case ESP_CHIP_ID_ESP32C3:
                AppendLog(hEditLog, "ESP32-C3\r\n");
                break;
            case ESP_CHIP_ID_ESP32S3:
                AppendLog(hEditLog, "ESP32-S3\r\n");
                break;
            case ESP_CHIP_ID_ESP32C2:
                AppendLog(hEditLog, "ESP32-C2\r\n");
                break;
            case ESP_CHIP_ID_ESP32C6:
                AppendLog(hEditLog, "ESP32-C6\r\n");
                break;
            case ESP_CHIP_ID_ESP32H2:
                AppendLog(hEditLog, "ESP32-H2\r\n");
                break;
            case ESP_CHIP_ID_ESP32P4:
                AppendLog(hEditLog, "ESP32-P4\r\n");
                break;
            case ESP_CHIP_ID_ESP32C5:
                AppendLog(hEditLog, "ESP32-C5\r\n");
                break;
            case ESP_CHIP_ID_ESP32C61:
                AppendLog(hEditLog, "ESP32-C61\r\n");
                break;
            case ESP_CHIP_ID_ESP32H21:
                AppendLog(hEditLog, "ESP32-H21\r\n");
                break;
            case ESP_CHIP_ID_ESP32H4:
                AppendLog(hEditLog, "ESP32-H4\r\n");
                break;
            case ESP_CHIP_ID_ESP32S31:
                AppendLog(hEditLog, "ESP32-S31\r\n");
                break;
            default:
                AppendLog(hEditLog, "Unknown\r\n");
                break;
            }
            AppendLog(hEditLog, "Entry Address: ");
            AppendLog_HEX(hEditLog, hdr->entry_addr);
            AppendLog(hEditLog, "\r\n");
            
            stats_images++;
            image_header = file_position;
            file_position += 24; // position us at the beginning of the first segment
            uint8_t segment_count = bin_data[image_header + 1]; // 2nd byte contains number of segments
            // Log number of segments
            AppendLog(hEditLog, "     Segments: " + std::to_string(segment_count) + "\r\n");
            AppendLog(hEditLog, "-----------------------\r\n");
            uint32_t segment_size = 0;
            uint32_t segment_addr = 0;
            crc_value = 0xef;
            for (int j = 0; j < segment_count; j++)
            {                
                segment_addr =
                    (uint32_t)bin_data[file_position] |
                    ((uint32_t)bin_data[file_position + 1] << 8) |
                    ((uint32_t)bin_data[file_position + 2] << 16) |
                    ((uint32_t)bin_data[file_position + 3] << 24);
                segment_size =
                    (uint32_t)bin_data[file_position + 4] |
                    ((uint32_t)bin_data[file_position + 5] << 8) |
                    ((uint32_t)bin_data[file_position + 6] << 16) |
                    ((uint32_t)bin_data[file_position + 7] << 24);
                AppendLog(hEditLog, " Segment #" + std::to_string(j) + "\r\n     Load Addr: ");
                AppendLog_HEX(hEditLog, segment_addr); // this would be its address in virtual space
                AppendLog(hEditLog, "\r\n   File Offset: ");
                AppendLog_HEX(hEditLog, file_position);
                AppendLog(hEditLog, "\r\n          Size: " + std::to_string(segment_size) + " bytes\r\n");
                file_position += 8; // skip over segment header
                for (unsigned int i = 0; i < segment_size; i++)
                {
                    crc_value ^= bin_data[file_position];
                    file_position++;
                }
            }
            uint32_t padding = (16 - ((file_position + 1) % 16)) % 16; // imagesize+1 for crc, happens to be our value in file_position. Since all images are 16-byte aligned/padded we do not need to consider relative image positions
            uint32_t crc_location = (file_position)+padding; 
            uint8_t old_crc = bin_data[crc_location];
            AppendLog(hEditLog, "Image original CRC:" + std::to_string(old_crc) + "\r\n");
            AppendLog(hEditLog, "Image computed CRC:" + std::to_string(crc_value) + "\r\n");
            // Step3: Update the CRC value, disable sha256 ; forced for now - to avoid sha256 errors on duplicate crcs
            //if (crc_value != bin_data[crc_location])
            {
                if (crc_location > filesize)
                {
                    stats_errors++;
                    crc_location = filesize - 33;// just a temporary thing until the crc locating is correct
                    AppendLog(hEditLog, " ERROR!! Expectd CRC not located within file\r\n");
                }
                else
                {
                    stats_crc_regenCount++;
                    bin_data[crc_location] = crc_value;
                }
                // Step4: Change checksum to simple CRC mode
                if (bin_data[image_header + 23])
                {
                    AppendLog(hEditLog, "   Image has has sha256\r\n");
                    bin_data[image_header + 23] = 0; // disables sha256
                    file_position = crc_location + 32 + 1;
                    AppendLog(hEditLog, "   Image sha256 has been disabled\r\n");
                    stats_sha256_disabledCount++;
                }
                else
                {
                    AppendLog(hEditLog, "   Image had no sha256 to disable\r\n");
                    file_position = crc_location + 1;
                }                
            }
        }
        else
            file_position += 16;// image headers are always 16-byte aligned
    }
    // Step5: Write output binary
    ofstream output_bin(filename, ios::out | ios::binary);
    AppendLog(hEditLog, "-----------------------------\r\n");
    AppendLog(hEditLog, "  Revalidation completed: " + std::to_string(filesize) + " bytes written\r\n");
    output_bin.write((char*)bin_data, filesize);
    output_bin.close();
    free(bin_data);
}

